# Student Data
This notebook analyizes pass/fail data for class

In [31]:
names = ['Dan','Joann','Pedro','Rosie','Ethan','Vicky','Frederic','Jimmie','Rhonda','Giovanni','Francesca','Rajab','Naiyana','Kian','Jenny','Jakeem','Helena','Ismat','Anila','Skye','Daniel','Aisha','Bill','Ted']
print(names)

['Dan', 'Joann', 'Pedro', 'Rosie', 'Ethan', 'Vicky', 'Frederic', 'Jimmie', 'Rhonda', 'Giovanni', 'Francesca', 'Rajab', 'Naiyana', 'Kian', 'Jenny', 'Jakeem', 'Helena', 'Ismat', 'Anila', 'Skye', 'Daniel', 'Aisha', 'Bill', 'Ted']

In [32]:
hours = [10,11.5,9,16,9.25,1,11.5,9,8.5,14.5,15.5,13.75,9,8,15.5,8,9,6,10,12,12.5,12,8,float('nan')]
print (hours)

[10, 11.5, 9, 16, 9.25, 1, 11.5, 9, 8.5, 14.5, 15.5, 13.75, 9, 8, 15.5, 8, 9, 6, 10, 12, 12.5, 12, 8, nan]

In [33]:
scores = [50,50,47,97,49,3,53,42,26,74,82,62,37,15,70,27,36,35,48,52,63,64,float('nan'),float('nan')]
print (scores)

[50, 50, 47, 97, 49, 3, 53, 42, 26, 74, 82, 62, 37, 15, 70, 27, 36, 35, 48, 52, 63, 64, nan, nan]

In [34]:
import numpy as np
np_names = np.array(names)
np_hours = np.array(hours)
np_scores = np.array(scores)

In [35]:
np_names.shape

(24,)

In [36]:
np_scores.shape

(24,)

In [37]:
np_hours.shape

(24,)

In [38]:
import pandas as pd

In [39]:
df = pd.DataFrame({
    "Names": np_names,
    "Hours": np_hours,
    "Scores": np_scores
})

In [40]:
print(df)

        Names  Hours  Scores
0         Dan  10.00    50.0
1       Joann  11.50    50.0
2       Pedro   9.00    47.0
3       Rosie  16.00    97.0
4       Ethan   9.25    49.0
5       Vicky   1.00     3.0
6    Frederic  11.50    53.0
7      Jimmie   9.00    42.0
8      Rhonda   8.50    26.0
9    Giovanni  14.50    74.0
10  Francesca  15.50    82.0
11      Rajab  13.75    62.0
12    Naiyana   9.00    37.0
13       Kian   8.00    15.0
14      Jenny  15.50    70.0
15     Jakeem   8.00    27.0
16     Helena   9.00    36.0
17      Ismat   6.00    35.0
18      Anila  10.00    48.0
19       Skye  12.00    52.0
20     Daniel  12.50    63.0
21      Aisha  12.00    64.0
22       Bill   8.00     NaN
23        Ted    NaN     NaN

In [41]:
dataset_path="/Users/mikeyom/Documents/JuypterNotebook/datascience/z_data"

In [42]:
df_students = pd.read_csv(f"{dataset_path}/student.csv")

In [43]:
print(df_students)

         Name  Hours  Score
0         Dan  10.00   50.0
1       Joann  11.50   50.0
2       Pedro   9.00   47.0
3       Rosie  16.00   97.0
4       Ethan   9.25   49.0
5       Vicky   1.00    3.0
6    Frederic  11.50   53.0
7      Jimmie   9.00   42.0
8      Rhonda   8.50   26.0
9    Giovanni  14.50   74.0
10  Francesca  15.50   82.0
11      Rajab  13.75   62.0
12    Naiyana   9.00   37.0
13       Kian   8.00   15.0
14      Jenny  15.50   70.0
15     Jakeem   8.00   27.0
16     Helena   9.00   36.0
17      Ismat   6.00   35.0
18      Anila  10.00   48.0
19       Skye  12.00   52.0
20     Daniel  12.50   63.0
21      Aisha  12.00   64.0
22       Bill   8.00    NaN
23        Ted    NaN    NaN

In [44]:
df_students.isnull()

     Name  Hours  Score
0   False  False  False
1   False  False  False
2   False  False  False
3   False  False  False
4   False  False  False
5   False  False  False
6   False  False  False
7   False  False  False
8   False  False  False
9   False  False  False
10  False  False  False
11  False  False  False
12  False  False  False
13  False  False  False
14  False  False  False
15  False  False  False
16  False  False  False
17  False  False  False
18  False  False  False
19  False  False  False
20  False  False  False
21  False  False  False
22  False  False   True
23  False   True   True

In [45]:
df_students.isnull().sum()

Name     0
Hours    1
Score    2
dtype: int64